$('.main-slider-wrapper').slick({
  dots: true,
  customPaging: function(slider, i) {
      // Разные контенты для каждой точки
      const dotContents = [
          `<div class="custom-dot custom-dot1">
              <svg fill="#000000" version="1.1" id="Layer_1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" 
                viewBox="0 0 512 512" xml:space="preserve">
              <g>
                <g>
                  <polygon points="93.775,353.794 93.775,405.889 418.225,405.889 418.225,390.681 418.225,353.794 		"/>
                </g>
              </g>
              <g>
                <g>
                  <path d="M80.569,106.111c-26.958,0-48.891,21.932-48.891,48.891v63.653h13.706c26.436,0,47.975,21.31,48.372,47.654h0.01h147.025
                    V106.111H80.569z"/>
                </g>
              </g>
              <g>
                <g>
                  <path d="M431.431,106.111H271.208v160.197h147.025h0.011c0.396-26.342,21.936-47.654,48.372-47.654h13.706v-63.653
                    C480.321,128.042,458.39,106.111,431.431,106.111z"/>
                </g>
              </g>
              <g>
                <g>
                  <rect x="93.776" y="296.72" width="324.45" height="26.653"/>
                </g>
              </g>
              <g>
                <g>
                  <path d="M45.385,249.071H17.974C8.063,249.071,0,257.134,0,267.044v138.844h63.358V267.045
                    C63.358,257.135,55.295,249.071,45.385,249.071z"/>
                </g>
              </g>
              <g>
                <g>
                  <path d="M494.026,249.07h-27.411c-9.91,0-17.974,8.063-17.974,17.974v29.68v14.626v42.444v52.095h63.357V267.044H512
                    C512,257.134,503.937,249.07,494.026,249.07z"/>
                </g>
              </g>
              </svg>
              <span>Комната</span>
          </div>`,
          `<div class="custom-dot custom-dot2">
             <svg fill="#000000" height="800px" width="800px" version="1.1" id="Layer_1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" 
	 viewBox="0 0 512 512" xml:space="preserve">
<g>
	<g>
		<polygon points="397.909,223.884 397.909,136.781 114.091,136.781 114.091,223.884 239.304,223.884 239.304,377.991 
			195.969,377.991 195.969,411.382 316.031,411.382 316.031,377.991 272.696,377.991 272.696,223.884 		"/>
	</g>
</g>
<g>
	<g>
		<path d="M99.156,239.311H59.262c-9.271,0-18.049,2.144-25.87,5.956V100.618H0v197.955v16.696v92.662h33.391V315.27h91.635v92.662
			h33.391V315.27v-16.696C158.417,265.896,131.832,239.311,99.156,239.311z"/>
	</g>
</g>
<g>
	<g>
		<path d="M478.609,100.618v144.649c-7.823-3.812-16.6-5.956-25.87-5.956h-39.894c-32.677,0-59.262,26.585-59.262,59.262v16.696
			v92.662h33.391V315.27h91.635v92.662H512V315.27v-16.696V100.618H478.609z"/>
	</g>
</g>
</svg>
              <span>Кухня</span>
          </div>`,
          `<div class="custom-dot custom-dot3">
             <svg fill="#000000" height="800px" width="800px" version="1.1" id="Layer_1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" 
                viewBox="0 0 512 512" xml:space="preserve">
              <g>
                <g>
                  <path d="M114.067,163.88v-39.727H74.34V98.057c0-4.601,3.743-8.344,8.345-8.344c4.602,0,8.345,3.743,8.345,8.344v10.094h30.417
                    V98.057c0-21.373-17.388-38.762-38.763-38.762c-21.374,0-38.763,17.388-38.763,38.762v26.096v15.209v24.518H0v39.728h24.452h5.965
                    h451.166h5.965H512V163.88H114.067z"/>
                </g>
              </g>
              <g>
                <g>
                  <path d="M457.13,234.025H54.87H24.452v71.064c0,38.653,20.453,72.614,51.101,91.645L62.665,444.83l29.381,7.874l11.696-43.649
                    c9.086,2.494,18.643,3.834,28.509,3.834h247.496c9.866,0,19.424-1.339,28.509-3.834l11.696,43.649l29.381-7.874l-12.888-48.097
                    c30.648-19.031,51.101-52.992,51.101-91.645v-71.064H457.13z M436.852,305.089c0,31.488-25.617,57.104-57.104,57.104v-30.417h0
                    c14.715,0,26.687-11.972,26.687-26.687v-35.577h30.417V305.089z"/>
                </g>
              </g>
              </svg>
              <span>Ванная</span>
          </div>`,
          `<div class="custom-dot custom-dot4">
              <svg fill="#000000" version="1.1" id="Layer_1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" 
                  viewBox="0 0 491.52 491.52" xml:space="preserve">
                <g>
                  <g>
                    <g>
                      <path d="M450.56,0H266.24v266.24h-40.96v-102.4H204.8v20.48c0,11.305-9.155,20.48-20.48,20.48s-20.48-9.175-20.48-20.48v-20.48
                        h-40.96v20.48c0,11.305-9.155,20.48-20.48,20.48s-20.48-9.175-20.48-20.48v-20.48H20.48v102.4v61.44h122.88v-61.44
                        c0-11.305,9.155-20.48,20.48-20.48s20.48,9.175,20.48,20.48v61.44H307.2v-61.44c0-11.305,9.155-20.48,20.48-20.48
                        s20.48,9.175,20.48,20.48v61.44h122.88v-61.44V20.48C471.04,9.175,461.885,0,450.56,0z M348.16,163.84
                        c0,11.305-9.155,20.48-20.48,20.48s-20.48-9.175-20.48-20.48v-40.96c0-11.305,9.155-20.48,20.48-20.48s20.48,9.175,20.48,20.48
                        V163.84z"/>
                      <rect x="184.32" y="368.64" width="122.88" height="81.92"/>
                      <path d="M20.48,430.08v40.96c0,11.305,9.155,20.48,20.48,20.48s20.48-9.175,20.48-20.48v-20.48h81.92v-81.92H20.48V430.08z"/>
                      <path d="M81.92,102.4c0-11.305,9.155-20.48,20.48-20.48s20.48,9.175,20.48,20.48v20.48h40.96V102.4
                        c0-11.305,9.155-20.48,20.48-20.48s20.48,9.175,20.48,20.48v20.48h20.48V0H40.96C29.635,0,20.48,9.175,20.48,20.48v102.4h61.44
                        V102.4z"/>
                      <path d="M348.16,450.56h81.92v20.48c0,11.305,9.155,20.48,20.48,20.48s20.48-9.175,20.48-20.48v-40.96v-61.44H348.16V450.56z"/>
                    </g>
                  </g>
                </g>
                </svg>
              <span>Прихожая</span>
          </div>`
      ];
      return dotContents[i]; // Возвращаем соответствующий контент для каждой точки
  }
});

$('.main-slider-wrapper').on('init', function(event, slick){
    var buttonTexts = ['Комната', 'Кухня', 'Ванная', 'Прихожая'];
  
    $('.slick-dots li button').each(function(index){
      $(this).text(buttonTexts[index]); // Присваиваем текст кнопкам
    });
});

$(document).ready(function(){
    $('.main-slider-wrapper').slick({
        dots: true,
        infinite: true,
        slidesToShow: 1,
        slidesToScroll: 1
    });
});

$(document).ready(function(){
    $('.sales-slider').slick({
        dots: false,
        infinite: true,
        slidesToShow: 3,
        slidesToScroll: 1,
        responsive: [
          {
            breakpoint: 992,
            settings: {
              slidesToShow: 2,
              slidesToScroll: 1,
            }
          },
          {
            breakpoint: 768,
            settings: {
              slidesToShow: 1,
              slidesToScroll: 1,
            }
          }
        ]
    });
});

$(document).ready(function(){
    $('.reviews-slider').slick({
        dots: false,
        infinite: true,
        slidesToShow: 3,
        slidesToScroll: 1,
        responsive: [
            {
              breakpoint: 1200,
              settings: {
                slidesToShow: 2,
                slidesToScroll: 1,
              }
            },
            {
              breakpoint: 768,
              settings: {
                slidesToShow: 1,
                slidesToScroll: 1,
              }
            }
          ]
    });
});